posts/2026-01-28-install-wsl-debian.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Install WSL Debian</title>
<meta name="description" content="官方的WSL分发版中，Debian的版本已经更新到13（代号trixie），大量的软件包得到了更新，可以长期稳定使用。">
<meta name="keywords" content="Linux, WSL, Debian">
<meta name="generator" content="Org Mode">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/css/main.bundle.min.css">
</head>
<body>
<header id="preamble" class="status">
<div class="site-header">
  <a class="site-title" href="/">Chuck</a>
  <div class="site-nav">
    <div id="menu-list" class="main-menu">
      <a href="/posts/">Posts</a>
      <a href="/about.html">About</a>
    </div>
    <button aria-label="Search" onclick="window.location.href='/search.html';">
      <svg width="20" height="20" viewBox="0 0 24 24">
        <path fill="currentcolor" d="M23.822 20.88l-6.353-6.354c.93-1.465 1.467-3.2 1.467-5.059.001-5.219-4.247-9.467-9.468-9.467s-9.468 4.248-9.468 9.468c0 5.221 4.247 9.469 9.468 9.469 1.768 0 3.421-.487 4.839-1.333l6.396 6.396 3.119-3.12zm-20.294-11.412c0-3.273 2.665-5.938 5.939-5.938 3.275 0 5.94 2.664 5.94 5.938 0 3.275-2.665 5.939-5.94 5.939-3.274 0-5.939-2.664-5.939-5.939z"></path>
      </svg>
    </button>
    <button id="appearance-switcher" aria-label="Appearance Switcher">
      <svg id="moon" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z">
        </path>
      </svg>
      <svg id="sun" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z">
        </path>
      </svg>
    </button>
    <button id="menu-button" aria-label="Menu">
      <svg width="20" height="20" viewBox="0 0 448 512">
        <path fill="currentcolor" d="M0 96C0 78.33 14.33 64 32 64H416c17.7.0 32 14.33 32 32 0 17.7-14.3 32-32 32H32C14.33 128 0 113.7.0 96zM0 256c0-17.7 14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32H32c-17.67.0-32-14.3-32-32zM416 448H32c-17.67.0-32-14.3-32-32s14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32z">
        </path>
      </svg>
    </button>
  </div>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Install WSL Debian</h1>
</header><p>
官方的WSL分发版中，Debian的版本已经更新到13（代号trixie），大量的软件包得到了更新，可以长期稳定使用。
</p>

<p>
安装Debian分发版到指定的位置： <code>wsl --install Debian --location D:\WSL\Debian --name Debian</code> 。
</p>

<p>
使用命令 <code>wsl -d Debian</code> 启动，首次启动时需要创建新的用户；如果后续需要默认使用 <code>root</code> 用户登录，则在 <code>/etc/wsl.conf</code> 中添加以下内容：
</p>

<div class="org-src-container">
<pre class="src src-bash">[user]
<span class="org-variable-name">default</span>=root
</pre>
</div>

<p>
默认情况下，WSL可以调用运行Windows已安装的软件，并将Windows的PATH追加到Debian中，可以添加以下配置禁用：
</p>

<div class="org-src-container">
<pre class="src src-bash">[interop]
<span class="org-variable-name">enabled</span>=false
<span class="org-variable-name">appendWindowsPath</span>=false
</pre>
</div>

<p>
Debian官方为HTTP源，如果要使用HTTPS源，需要先安装 <code>apt install apt-transport-https ca-certificates</code> ，然后修改 <code>/etc/apt/sources.list</code> 使用HTTPS源。
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#27880;&#37322;&#20102;&#28304;&#30721;&#38236;&#20687;&#20197;&#25552;&#39640; apt update &#36895;&#24230;&#65292;&#22914;&#26377;&#38656;&#35201;&#21487;&#33258;&#34892;&#21462;&#28040;&#27880;&#37322;
</span>deb https://mirrors.tuna.tsinghua.edu.cn/debian/ trixie main contrib non-free non-free-firmware
<span class="org-comment-delimiter"># </span><span class="org-comment">deb-src https://mirrors.tuna.tsinghua.edu.cn/debian/ trixie main contrib non-free non-free-firmware
</span>
deb https://mirrors.tuna.tsinghua.edu.cn/debian/ trixie-updates main contrib non-free non-free-firmware
<span class="org-comment-delimiter"># </span><span class="org-comment">deb-src https://mirrors.tuna.tsinghua.edu.cn/debian/ trixie-updates main contrib non-free non-free-firmware
</span>
deb https://mirrors.tuna.tsinghua.edu.cn/debian/ trixie-backports main contrib non-free non-free-firmware
<span class="org-comment-delimiter"># </span><span class="org-comment">deb-src https://mirrors.tuna.tsinghua.edu.cn/debian/ trixie-backports main contrib non-free non-free-firmware
</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#20197;&#19979;&#23433;&#20840;&#26356;&#26032;&#36719;&#20214;&#28304;&#21253;&#21547;&#20102;&#23448;&#26041;&#28304;&#19982;&#38236;&#20687;&#31449;&#37197;&#32622;&#65292;&#22914;&#26377;&#38656;&#35201;&#21487;&#33258;&#34892;&#20462;&#25913;&#27880;&#37322;&#20999;&#25442;
</span>deb https://mirrors.tuna.tsinghua.edu.cn/debian-security trixie-security main contrib non-free non-free-firmware
<span class="org-comment-delimiter"># </span><span class="org-comment">deb-src https://mirrors.tuna.tsinghua.edu.cn/debian-security trixie-security main contrib non-free non-free-firmware</span>
</pre>
</div>

<p>
上面是传统格式的修改方法，如果是DEB822格式，则修改 <code>/etc/apt/sources.list.d/debian.sources</code> 文件内容为：
</p>

<div class="org-src-container">
<pre class="src src-bash">Types: deb
URIs: https://mirrors.tuna.tsinghua.edu.cn/debian
Suites: trixie trixie-updates trixie-backports
Components: main contrib non-free non-free-firmware
Signed-By: /usr/share/keyrings/debian-archive-keyring.gpg

<span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#27880;&#37322;&#20102;&#28304;&#30721;&#38236;&#20687;&#20197;&#25552;&#39640; apt update &#36895;&#24230;&#65292;&#22914;&#26377;&#38656;&#35201;&#21487;&#33258;&#34892;&#21462;&#28040;&#27880;&#37322;
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Types: deb-src
</span><span class="org-comment-delimiter"># </span><span class="org-comment">URIs: https://mirrors.tuna.tsinghua.edu.cn/debian
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Suites: trixie trixie-updates trixie-backports
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Components: main contrib non-free non-free-firmware
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Signed-By: /usr/share/keyrings/debian-archive-keyring.gpg
</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#20197;&#19979;&#23433;&#20840;&#26356;&#26032;&#36719;&#20214;&#28304;&#21253;&#21547;&#20102;&#23448;&#26041;&#28304;&#19982;&#38236;&#20687;&#31449;&#37197;&#32622;&#65292;&#22914;&#26377;&#38656;&#35201;&#21487;&#33258;&#34892;&#20462;&#25913;&#27880;&#37322;&#20999;&#25442;
</span>Types: deb
URIs: https://mirrors.tuna.tsinghua.edu.cn/debian-security
Suites: trixie-security
Components: main contrib non-free non-free-firmware
Signed-By: /usr/share/keyrings/debian-archive-keyring.gpg

<span class="org-comment-delimiter"># </span><span class="org-comment">Types: deb-src
</span><span class="org-comment-delimiter"># </span><span class="org-comment">URIs: https://mirrors.tuna.tsinghua.edu.cn/debian-security
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Suites: trixie-security
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Components: main contrib non-free non-free-firmware
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Signed-By: /usr/share/keyrings/debian-archive-keyring.gpg</span>
</pre>
</div>

<p>
最后，就可以更新和安装新的软件包了：
</p>

<div class="org-src-container">
<pre class="src src-bash">apt update
apt upgrade
apt dist-upgrade
</pre>
</div>
</main>
<footer id="postamble" class="status">
<div class="site-footer">
  <p>&copy 2026 Chuck</p>
  <p>Powered by <a href="https://www.gnu.org/software/emacs/">Emacs</a></p>
</div>
<a href="#top" class="top-link" id="top-link" style="visibility: hidden; opacity: 0;">
  <svg xmlns="http://www.w3.org/2000/svg" height="24px" width="24px" viewBox="0 -960 960 960" fill="currentcolor">
    <path d="M440-160v-487L216-423l-56-57 320-320 320 320-56 57-224-224v487h-80Z"></path>
  </svg>
</a>
</footer>
</body>
</html>
